Reports/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>Выписка</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ОсновнойКошелек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОсновнойКошелек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Выписка/Forms/ФормаОтчета/Ext/Form/Module.bsl
Функция ПолучитьОсновнойКошелек()
	
	    Настройки = Отчет.КомпоновщикНастроек.Настройки;
    	Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
			|	ОсновнойКошелекСрезПоследних.Кошелек КАК Кошелек
			|ИЗ
			|	РегистрСведений.ОсновнойКошелек.СрезПоследних(, Основной) КАК ОсновнойКошелекСрезПоследних";

		ВыборкаКошелек = Запрос.Выполнить().Выбрать();

		Если ВыборкаКошелек.Следующий() Тогда
			
			Возврат ВыборкаКошелек.Кошелек;
			  
		Иначе
			Возврат Неопределено;
		КонецЕсли;

	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Кошелек = ПолучитьОсновнойКошелек();
	Если Кошелек <> Неопределено Тогда
		ПараметрыСКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
		НайденныйПараметр = ПараметрыСКД.найти("Кошелек");	
		НайденныйПараметр.Значение = Кошелек;
		НайденныйПараметр.Использование = Истина;	  			
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
